/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_toupper.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: gdel-val <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/09/17 03:06:59 by gdel-val          #+#    #+#             */
/*   Updated: 2023/10/02 18:50:36 by gdel-val         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

int	ft_toupper(int c)
{
	if ('a' <= c && c <= 'z')
		c = c - 32;
	return (c);
}
/*
int main(void)
{
	char min = 'a';
	char mayu = ft_toupper(min);

	printf("Mayúscula: %c\n", mayu);

	return (0);
}*/
